zephyrproject-rtos/zephyr/ext/hal/cypress/PDL/3.1.0/devices/psoc6/include/ip/cyip_udb.h
/***************************************************************************//**
* \file cyip_udb.h
*
* \brief
* UDB IP definitions
*
* \note
* Generator version: 1.3.0.1146
* Database revision: rev#1050929
*
********************************************************************************
* \copyright
* Copyright 2016-2018, Cypress Semiconductor Corporation. All rights reserved.
* SPDX-License-Identifier: Apache-2.0



*******************************************************************************/

#ifndef _CYIP_UDB_H_
#define _CYIP_UDB_H_

#include "cyip_headers.h"

/*******************************************************************************
*                                     UDB
*******************************************************************************/

#define UDB_WRKONE_SECTION_SIZE                 0x00000800UL
#define UDB_WRKMULT_SECTION_SIZE                0x00001000UL
#define UDB_UDBPAIR_UDBSNG_SECTION_SIZE         0x00000080UL
#define UDB_UDBPAIR_ROUTE_SECTION_SIZE          0x00000100UL
#define UDB_UDBPAIR_SECTION_SIZE                0x00000200UL
#define UDB_DSI_SECTION_SIZE                    0x00000080UL
#define UDB_PA_SECTION_SIZE                     0x00000040UL
#define UDB_BCTL_SECTION_SIZE                   0x00000080UL
#define UDB_UDBIF_SECTION_SIZE                  0x00000020UL
#define UDB_SECTION_SIZE                        0x00010000UL

/**
  * \brief UDB Working Registers (2 registers from one UDB at a time) (UDB_WRKONE)
  */
typedef struct {
  __IOM uint32_t A[64];                         /*!< 0x00000000 Accumulator Registers {A1,A0} */
  __IOM uint32_t D[64];                         /*!< 0x00000100 Data Registers {D1,D0} */
  __IOM uint32_t F[64];                         /*!< 0x00000200 FIFOs {F1,F0} */
  __IOM uint32_t CTL_ST[64];                    /*!< 0x00000300 Status and Control Registers {CTL,ST} */
  __IOM uint32_t ACTL_MSK[64];                  /*!< 0x00000400 Mask and Auxiliary Control Registers {ACTL,MSK} */
   __IM uint32_t MC[64];                        /*!< 0x00000500 PLD Macrocell Read Registers {00,MC} */
   __IM uint32_t RESERVED[128];
} UDB_WRKONE_V1_Type;                           /*!< Size = 2048 (0x800) */

/**
  * \brief UDB Working Registers (1 register from multiple UDBs at a time) (UDB_WRKMULT)
  */
typedef struct {
  __IOM uint32_t A0[64];                        /*!< 0x00000000 Accumulator 0 */
  __IOM uint32_t A1[64];                        /*!< 0x00000100 Accumulator 1 */
  __IOM uint32_t D0[64];                        /*!< 0x00000200 Data 0 */
  __IOM uint32_t D1[64];                        /*!< 0x00000300 Data 1 */
  __IOM uint32_t F0[64];                        /*!< 0x00000400 FIFO 0 */
  __IOM uint32_t F1[64];                        /*!< 0x00000500 FIFO 1 */
   __IM uint32_t ST[64];                        /*!< 0x00000600 Status Register */
  __IOM uint32_t CTL[64];                       /*!< 0x00000700 Control Register */
  __IOM uint32_t MSK[64];                       /*!< 0x00000800 Interrupt Mask */
  __IOM uint32_t ACTL[64];                      /*!< 0x00000900 Auxiliary Control */
   __IM uint32_t MC[64];                        /*!< 0x00000A00 PLD Macrocell reading */
   __IM uint32_t RESERVED[320];
} UDB_WRKMULT_V1_Type;                          /*!< Size = 4096 (0x1000) */

/**
  * \brief Single UDB Configuration (UDB_UDBPAIR_UDBSNG)
  */
typedef struct {
  __IOM uint32_t PLD_IT[12];                    /*!< 0x00000000 PLD Input Terms */
  __IOM uint32_t PLD_ORT0;                      /*!< 0x00000030 PLD OR Terms */
  __IOM uint32_t PLD_ORT1;                      /*!< 0x00000034 PLD OR Terms */
  __IOM uint32_t PLD_CFG0;                      /*!< 0x00000038 PLD configuration for Carry Enable, Constant, and XOR feedback */
  __IOM uint32_t PLD_CFG1;                      /*!< 0x0000003C PLD configuration for Set / Reset selection, and Bypass control */
  __IOM uint32_t DPATH_CFG0;                    /*!< 0x00000040 Datapath input selections (RAD0, RAD1, RAD2, F0_LD, F1_LD,
                                                                D0_LD, D1_LD) */
  __IOM uint32_t DPATH_CFG1;                    /*!< 0x00000044 Datapath input and output selections (SCI_MUX, SI_MUX, OUT0
                                                                thru OUT5) */
  __IOM uint32_t DPATH_CFG2;                    /*!< 0x00000048 Datapath output synchronization, ALU mask, compare 0 and 1
                                                                masks */
  __IOM uint32_t DPATH_CFG3;                    /*!< 0x0000004C Datapath mask enables, shift in, carry in, compare, chaining,
                                                                MSB configs; FIFO, shift and parallel input control */
  __IOM uint32_t DPATH_CFG4;                    /*!< 0x00000050 Datapath FIFO and register access configuration control */
  __IOM uint32_t SC_CFG0;                       /*!< 0x00000054 SC Mode 0 and 1 control registers; status register input mode;
                                                                general SC configuration */
  __IOM uint32_t SC_CFG1;                       /*!< 0x00000058 SC counter control */
  __IOM uint32_t RC_CFG0;                       /*!< 0x0000005C PLD0, PLD1, Datatpath, and SC clock and reset control */
  __IOM uint32_t RC_CFG1;                       /*!< 0x00000060 PLD0, PLD1, Datatpath, and SC clock selection, general reset
                                                                control */
  __IOM uint32_t DPATH_OPC[4];                  /*!< 0x00000064 Datapath opcode configuration */
   __IM uint32_t RESERVED[3];
} UDB_UDBPAIR_UDBSNG_V1_Type;                   /*!< Size = 128 (0x80) */

/**
  * \brief Routing Configuration for one UDB Pair (UDB_UDBPAIR_ROUTE)
  */
typedef struct {
  __IOM uint32_t TOP_V_BOT;                     /*!< 0x00000000 Top Vertical Input (TVI) vs Bottom Vertical Input (BVI) muxing */
  __IOM uint32_t LVO1_V_2;                      /*!< 0x00000004 Left Vertical Ouput (LVO) 1 vs 2 muxing for certain horizontals */
  __IOM uint32_t RVO1_V_2;                      /*!< 0x00000008 Right Vertical Ouput (RVO) 1 vs 2 muxing for certain
                                                                horizontals */
  __IOM uint32_t TUI_CFG0;                      /*!< 0x0000000C Top UDB Input (TUI) selection */
  __IOM uint32_t TUI_CFG1;                      /*!< 0x00000010 Top UDB Input (TUI) selection */
  __IOM uint32_t TUI_CFG2;                      /*!< 0x00000014 Top UDB Input (TUI) selection */
  __IOM uint32_t TUI_CFG3;                      /*!< 0x00000018 Top UDB Input (TUI) selection */
  __IOM uint32_t TUI_CFG4;                      /*!< 0x0000001C Top UDB Input (TUI) selection */
  __IOM uint32_t TUI_CFG5;                      /*!< 0x00000020 Top UDB Input (TUI) selection */
  __IOM uint32_t BUI_CFG0;                      /*!< 0x00000024 Bottom UDB Input (BUI) selection */
  __IOM uint32_t BUI_CFG1;                      /*!< 0x00000028 Bottom UDB Input (BUI) selection */
  __IOM uint32_t BUI_CFG2;                      /*!< 0x0000002C Bottom UDB Input (BUI) selection */
  __IOM uint32_t BUI_CFG3;                      /*!< 0x00000030 Bottom UDB Input (BUI) selection */
  __IOM uint32_t BUI_CFG4;                      /*!< 0x00000034 Bottom UDB Input (BUI) selection */
  __IOM uint32_t BUI_CFG5;                      /*!< 0x00000038 Bottom UDB Input (BUI) selection */
  __IOM uint32_t RVO_CFG0;                      /*!< 0x0000003C Right Vertical Ouput (RVO) selection */
  __IOM uint32_t RVO_CFG1;                      /*!< 0x00000040 Right Vertical Ouput (RVO) selection */
  __IOM uint32_t RVO_CFG2;                      /*!< 0x00000044 Right Vertical Ouput (RVO) selection */
  __IOM uint32_t RVO_CFG3;                      /*!< 0x00000048 Right Vertical Ouput (RVO) selection */
  __IOM uint32_t LVO_CFG0;                      /*!< 0x0000004C Left Vertical Ouput (LVO) selection */
  __IOM uint32_t LVO_CFG1;                      /*!< 0x00000050 Left Vertical Ouput (LVO) selection */
  __IOM uint32_t RHO_CFG0;                      /*!< 0x00000054 Right Horizontal Out (RHO) selection */
  __IOM uint32_t RHO_CFG1;                      /*!< 0x00000058 Right Horizontal Out (RHO) selection */
  __IOM uint32_t RHO_CFG2;                      /*!< 0x0000005C Right Horizontal Out (RHO) selection */
  __IOM uint32_t LHO_CFG0;                      /*!< 0x00000060 Left Horizontal Out (LHO) selection */
  __IOM uint32_t LHO_CFG1;                      /*!< 0x00000064 Left Horizontal Out (LHO) selection */
  __IOM uint32_t LHO_CFG2;                      /*!< 0x00000068 Left Horizontal Out (LHO) selection */
  __IOM uint32_t LHO_CFG3;                      /*!< 0x0000006C Left Horizontal Out (LHO) selection */
  __IOM uint32_t LHO_CFG4;                      /*!< 0x00000070 Left Horizontal Out (LHO) selection */
  __IOM uint32_t LHO_CFG5;                      /*!< 0x00000074 Left Horizontal Out (LHO) selection */
  __IOM uint32_t LHO_CFG6;                      /*!< 0x00000078 Left Horizontal Out (LHO) selection */
  __IOM uint32_t LHO_CFG7;                      /*!< 0x0000007C Left Horizontal Out (LHO) selection */
  __IOM uint32_t LHO_CFG8;                      /*!< 0x00000080 Left Horizontal Out (LHO) selection */
  __IOM uint32_t LHO_CFG9;                      /*!< 0x00000084 Left Horizontal Out (LHO) selection */
  __IOM uint32_t LHO_CFG10;                     /*!< 0x00000088 Left Horizontal Out (LHO) selection */
  __IOM uint32_t LHO_CFG11;                     /*!< 0x0000008C Left Horizontal Out (LHO) selection */
   __IM uint32_t RESERVED[28];
} UDB_UDBPAIR_ROUTE_V1_Type;                    /*!< Size = 256 (0x100) */

/**
  * \brief UDB Pair Configuration (up to 32 Pairs) (UDB_UDBPAIR)
  */
typedef struct {
        UDB_UDBPAIR_UDBSNG_V1_Type UDBSNG[2];   /*!< 0x00000000 Single UDB Configuration */
        UDB_UDBPAIR_ROUTE_V1_Type ROUTE;        /*!< 0x00000100 Routing Configuration for one UDB Pair */
} UDB_UDBPAIR_V1_Type;                          /*!< Size = 512 (0x200) */

/**
  * \brief DSI Configuration (up to 32 DSI) (UDB_DSI)
  */
typedef struct {
  __IOM uint32_t LVO1_V_2;                      /*!< 0x00000000 Left Vertical Ouput (LVO) 1 vs 2 muxing for certain horizontals */
  __IOM uint32_t RVO1_V_2;                      /*!< 0x00000004 Right Vertical Ouput (RVO) 1 vs 2 muxing for certain
                                                                horizontals */
  __IOM uint32_t DOP_CFG0;                      /*!< 0x00000008 DSI Out Pair (DOP) selection */
  __IOM uint32_t DOP_CFG1;                      /*!< 0x0000000C DSI Out Pair (DOP) selection */
  __IOM uint32_t DOP_CFG2;                      /*!< 0x00000010 DSI Out Pair (DOP) selection */
  __IOM uint32_t DOP_CFG3;                      /*!< 0x00000014 DSI Out Pair (DOP) selection */
  __IOM uint32_t DOT_CFG0;                      /*!< 0x00000018 DSI Out Triplet (DOT) selection */
  __IOM uint32_t DOT_CFG1;                      /*!< 0x0000001C DSI Out Triplet (DOT) selection */
  __IOM uint32_t DOT_CFG2;                      /*!< 0x00000020 DSI Out Triplet (DOT) selection */
  __IOM uint32_t DOT_CFG3;                      /*!< 0x00000024 DSI Out Triplet (DOT) selection */
  __IOM uint32_t RVO_CFG0;                      /*!< 0x00000028 Right Vertical Ouput (RVO) selection */
  __IOM uint32_t RVO_CFG1;                      /*!< 0x0000002C Right Vertical Ouput (RVO) selection */
  __IOM uint32_t RVO_CFG2;                      /*!< 0x00000030 Right Vertical Ouput (RVO) selection */
  __IOM uint32_t RVO_CFG3;                      /*!< 0x00000034 Right Vertical Ouput (RVO) selection */
  __IOM uint32_t LVO_CFG0;                      /*!< 0x00000038 Left Vertical Ouput (LVO) selection */
  __IOM uint32_t LVO_CFG1;                      /*!< 0x0000003C Left Vertical Ouput (LVO) selection */
  __IOM uint32_t RHO_CFG0;                      /*!< 0x00000040 Right Horizontal Out (RHO) selection */
  __IOM uint32_t RHO_CFG1;                      /*!< 0x00000044 Right Horizontal Out (RHO) selection */
  __IOM uint32_t RHO_CFG2;                      /*!< 0x00000048 Right Horizontal Out (RHO) selection */
  __IOM uint32_t LHO_CFG0;                      /*!< 0x0000004C Left Horizontal Out (LHO) selection */
  __IOM uint32_t LHO_CFG1;                      /*!< 0x00000050 Left Horizontal Out (LHO) selection */
  __IOM uint32_t LHO_CFG2;                      /*!< 0x00000054 Left Horizontal Out (LHO) selection */
  __IOM uint32_t LHO_CFG3;                      /*!< 0x00000058 Left Horizontal Out (LHO) selection */
  __IOM uint32_t LHO_CFG4;                      /*!< 0x0000005C Left Horizontal Out (LHO) selection */
  __IOM uint32_t LHO_CFG5;                      /*!< 0x00000060 Left Horizontal Out (LHO) selection */
  __IOM uint32_t LHO_CFG6;                      /*!< 0x00000064 Left Horizontal Out (LHO) selection */
  __IOM uint32_t LHO_CFG7;                      /*!< 0x00000068 Left Horizontal Out (LHO) selection */
  __IOM uint32_t LHO_CFG8;                      /*!< 0x0000006C Left Horizontal Out (LHO) selection */
  __IOM uint32_t LHO_CFG9;                      /*!< 0x00000070 Left Horizontal Out (LHO) selection */
  __IOM uint32_t LHO_CFG10;                     /*!< 0x00000074 Left Horizontal Out (LHO) selection */
  __IOM uint32_t LHO_CFG11;                     /*!< 0x00000078 Left Horizontal Out (LHO) selection */
   __IM uint32_t RESERVED;
} UDB_DSI_V1_Type;                              /*!< Size = 128 (0x80) */

/**
  * \brief Port Adapter Configuration (up to 32 PA) (UDB_PA)
  */
typedef struct {
  __IOM uint32_t CFG0;                          /*!< 0x00000000 PA Data In Clock Control Register */
  __IOM uint32_t CFG1;                          /*!< 0x00000004 PA Data Out Clock Control Register */
  __IOM uint32_t CFG2;                          /*!< 0x00000008 PA Clock Select Register */
  __IOM uint32_t CFG3;                          /*!< 0x0000000C PA Reset Select Register */
  __IOM uint32_t CFG4;                          /*!< 0x00000010 PA Reset Enable Register */
  __IOM uint32_t CFG5;                          /*!< 0x00000014 PA Reset Pin Select Register */
  __IOM uint32_t CFG6;                          /*!< 0x00000018 PA Input Data Sync Control Register - Low */
  __IOM uint32_t CFG7;                          /*!< 0x0000001C PA Input Data Sync Control Register - High */
  __IOM uint32_t CFG8;                          /*!< 0x00000020 PA Output Data Sync Control Register - Low */
  __IOM uint32_t CFG9;                          /*!< 0x00000024 PA Output Data Sync Control Register - High */
  __IOM uint32_t CFG10;                         /*!< 0x00000028 PA Output Data Select Register - Low */
  __IOM uint32_t CFG11;                         /*!< 0x0000002C PA Output Data Select Register - High */
  __IOM uint32_t CFG12;                         /*!< 0x00000030 PA OE Select Register - Low */
  __IOM uint32_t CFG13;                         /*!< 0x00000034 PA OE Select Register - High */
  __IOM uint32_t CFG14;                         /*!< 0x00000038 PA OE Sync Register */
   __IM uint32_t RESERVED;
} UDB_PA_V1_Type;                               /*!< Size = 64 (0x40) */

/**
  * \brief UDB Array Bank Control (UDB_BCTL)
  */
typedef struct {
  __IOM uint32_t MDCLK_EN;                      /*!< 0x00000000 Master Digital Clock Enable Register */
  __IOM uint32_t MBCLK_EN;                      /*!< 0x00000004 Master clk_peri_app Enable Register */
  __IOM uint32_t BOTSEL_L;                      /*!< 0x00000008 Lower Nibble Bottom Digital Clock Select Register */
  __IOM uint32_t BOTSEL_U;                      /*!< 0x0000000C Upper Nibble Bottom Digital Clock Select Register */
  __IOM uint32_t QCLK_EN[16];                   /*!< 0x00000010 Quadrant Digital Clock Enable Registers */
   __IM uint32_t RESERVED[12];
} UDB_BCTL_V1_Type;                             /*!< Size = 128 (0x80) */

/**
  * \brief UDB Subsystem Interface Configuration (UDB_UDBIF)
  */
typedef struct {
  __IOM uint32_t BANK_CTL;                      /*!< 0x00000000 Bank Control */
  __IOM uint32_t INT_CLK_CTL;                   /*!< 0x00000004 Interrupt Clock Control */
  __IOM uint32_t INT_CFG;                       /*!< 0x00000008 Interrupt Configuration */
  __IOM uint32_t TR_CLK_CTL;                    /*!< 0x0000000C Trigger Clock Control */
  __IOM uint32_t TR_CFG;                        /*!< 0x00000010 Trigger Configuration */
  __IOM uint32_t PRIVATE;                       /*!< 0x00000014 Internal use only */
   __IM uint32_t RESERVED[2];
} UDB_UDBIF_V1_Type;                            /*!< Size = 32 (0x20) */

/**
  * \brief Programmable Digital Subsystem (UDB)
  */
typedef struct {
        UDB_WRKONE_V1_Type WRKONE;              /*!< 0x00000000 UDB Working Registers (2 registers from one UDB at a time) */
   __IM uint32_t RESERVED[512];
        UDB_WRKMULT_V1_Type WRKMULT;            /*!< 0x00001000 UDB Working Registers (1 register from multiple UDBs at a time) */
        UDB_UDBPAIR_V1_Type UDBPAIR[32];        /*!< 0x00002000 UDB Pair Configuration (up to 32 Pairs) */
        UDB_DSI_V1_Type DSI[32];                /*!< 0x00006000 DSI Configuration (up to 32 DSI) */
        UDB_PA_V1_Type PA[32];                  /*!< 0x00007000 Port Adapter Configuration (up to 32 PA) */
        UDB_BCTL_V1_Type BCTL;                  /*!< 0x00007800 UDB Array Bank Control */
   __IM uint32_t RESERVED1[32];
        UDB_UDBIF_V1_Type UDBIF;                /*!< 0x00007900 UDB Subsystem Interface Configuration */
} UDB_V1_Type;                                  /*!< Size = 31008 (0x7920) */


/* UDB_WRKONE.A */
#define UDB_WRKONE_A_A0_Pos                     0UL
#define UDB_WRKONE_A_A0_Msk                     0xFFUL
#define UDB_WRKONE_A_A1_Pos                     8UL
#define UDB_WRKONE_A_A1_Msk                     0xFF00UL
/* UDB_WRKONE.D */
#define UDB_WRKONE_D_D0_Pos                     0UL
#define UDB_WRKONE_D_D0_Msk                     0xFFUL
#define UDB_WRKONE_D_D1_Pos                     8UL
#define UDB_WRKONE_D_D1_Msk                     0xFF00UL
/* UDB_WRKONE.F */
#define UDB_WRKONE_F_F0_Pos                     0UL
#define UDB_WRKONE_F_F0_Msk                     0xFFUL
#define UDB_WRKONE_F_F1_Pos                     8UL
#define UDB_WRKONE_F_F1_Msk                     0xFF00UL
/* UDB_WRKONE.CTL_ST */
#define UDB_WRKONE_CTL_ST_ST_Pos                0UL
#define UDB_WRKONE_CTL_ST_ST_Msk                0xFFUL
#define UDB_WRKONE_CTL_ST_CTL_Pos               8UL
#define UDB_WRKONE_CTL_ST_CTL_Msk               0xFF00UL
/* UDB_WRKONE.ACTL_MSK */
#define UDB_WRKONE_ACTL_MSK_MSK_Pos             0UL
#define UDB_WRKONE_ACTL_MSK_MSK_Msk             0x7FUL
#define UDB_WRKONE_ACTL_MSK_FIFO0_CLR_Pos       8UL
#define UDB_WRKONE_ACTL_MSK_FIFO0_CLR_Msk       0x100UL
#define UDB_WRKONE_ACTL_MSK_FIFO1_CLR_Pos       9UL
#define UDB_WRKONE_ACTL_MSK_FIFO1_CLR_Msk       0x200UL
#define UDB_WRKONE_ACTL_MSK_FIFO0_LVL_Pos       10UL
#define UDB_WRKONE_ACTL_MSK_FIFO0_LVL_Msk       0x400UL
#define UDB_WRKONE_ACTL_MSK_FIFO1_LVL_Pos       11UL
#define UDB_WRKONE_ACTL_MSK_FIFO1_LVL_Msk       0x800UL
#define UDB_WRKONE_ACTL_MSK_INT_EN_Pos          12UL
#define UDB_WRKONE_ACTL_MSK_INT_EN_Msk          0x1000UL
#define UDB_WRKONE_ACTL_MSK_CNT_START_Pos       13UL
#define UDB_WRKONE_ACTL_MSK_CNT_START_Msk       0x2000UL
/* UDB_WRKONE.MC */
#define UDB_WRKONE_MC_PLD0_MC_Pos               0UL
#define UDB_WRKONE_MC_PLD0_MC_Msk               0xFUL
#define UDB_WRKONE_MC_PLD1_MC_Pos               4UL
#define UDB_WRKONE_MC_PLD1_MC_Msk               0xF0UL


