zephyrproject-rtos/zephyr/ext/hal/cypress/PDL/3.1.0/devices/psoc6/include/ip/cyip_udb.h
/* UDB_WRKMULT.A0 */
#define UDB_WRKMULT_A0_A0_0_Pos                 0UL
#define UDB_WRKMULT_A0_A0_0_Msk                 0xFFUL
#define UDB_WRKMULT_A0_A0_1_Pos                 8UL
#define UDB_WRKMULT_A0_A0_1_Msk                 0xFF00UL
#define UDB_WRKMULT_A0_A0_2_Pos                 16UL
#define UDB_WRKMULT_A0_A0_2_Msk                 0xFF0000UL
#define UDB_WRKMULT_A0_A0_3_Pos                 24UL
#define UDB_WRKMULT_A0_A0_3_Msk                 0xFF000000UL
/* UDB_WRKMULT.A1 */
#define UDB_WRKMULT_A1_A1_0_Pos                 0UL
#define UDB_WRKMULT_A1_A1_0_Msk                 0xFFUL
#define UDB_WRKMULT_A1_A1_1_Pos                 8UL
#define UDB_WRKMULT_A1_A1_1_Msk                 0xFF00UL
#define UDB_WRKMULT_A1_A1_2_Pos                 16UL
#define UDB_WRKMULT_A1_A1_2_Msk                 0xFF0000UL
#define UDB_WRKMULT_A1_A1_3_Pos                 24UL
#define UDB_WRKMULT_A1_A1_3_Msk                 0xFF000000UL
/* UDB_WRKMULT.D0 */
#define UDB_WRKMULT_D0_D0_0_Pos                 0UL
#define UDB_WRKMULT_D0_D0_0_Msk                 0xFFUL
#define UDB_WRKMULT_D0_D0_1_Pos                 8UL
#define UDB_WRKMULT_D0_D0_1_Msk                 0xFF00UL
#define UDB_WRKMULT_D0_D0_2_Pos                 16UL
#define UDB_WRKMULT_D0_D0_2_Msk                 0xFF0000UL
#define UDB_WRKMULT_D0_D0_3_Pos                 24UL
#define UDB_WRKMULT_D0_D0_3_Msk                 0xFF000000UL
/* UDB_WRKMULT.D1 */
#define UDB_WRKMULT_D1_D1_0_Pos                 0UL
#define UDB_WRKMULT_D1_D1_0_Msk                 0xFFUL
#define UDB_WRKMULT_D1_D1_1_Pos                 8UL
#define UDB_WRKMULT_D1_D1_1_Msk                 0xFF00UL
#define UDB_WRKMULT_D1_D1_2_Pos                 16UL
#define UDB_WRKMULT_D1_D1_2_Msk                 0xFF0000UL
#define UDB_WRKMULT_D1_D1_3_Pos                 24UL
#define UDB_WRKMULT_D1_D1_3_Msk                 0xFF000000UL
/* UDB_WRKMULT.F0 */
#define UDB_WRKMULT_F0_F0_0_Pos                 0UL
#define UDB_WRKMULT_F0_F0_0_Msk                 0xFFUL
#define UDB_WRKMULT_F0_F0_1_Pos                 8UL
#define UDB_WRKMULT_F0_F0_1_Msk                 0xFF00UL
#define UDB_WRKMULT_F0_F0_2_Pos                 16UL
#define UDB_WRKMULT_F0_F0_2_Msk                 0xFF0000UL
#define UDB_WRKMULT_F0_F0_3_Pos                 24UL
#define UDB_WRKMULT_F0_F0_3_Msk                 0xFF000000UL
/* UDB_WRKMULT.F1 */
#define UDB_WRKMULT_F1_F1_0_Pos                 0UL
#define UDB_WRKMULT_F1_F1_0_Msk                 0xFFUL
#define UDB_WRKMULT_F1_F1_1_Pos                 8UL
#define UDB_WRKMULT_F1_F1_1_Msk                 0xFF00UL
#define UDB_WRKMULT_F1_F1_2_Pos                 16UL
#define UDB_WRKMULT_F1_F1_2_Msk                 0xFF0000UL
#define UDB_WRKMULT_F1_F1_3_Pos                 24UL
#define UDB_WRKMULT_F1_F1_3_Msk                 0xFF000000UL
/* UDB_WRKMULT.ST */
#define UDB_WRKMULT_ST_ST_0_Pos                 0UL
#define UDB_WRKMULT_ST_ST_0_Msk                 0xFFUL
#define UDB_WRKMULT_ST_ST_1_Pos                 8UL
#define UDB_WRKMULT_ST_ST_1_Msk                 0xFF00UL
#define UDB_WRKMULT_ST_ST_2_Pos                 16UL
#define UDB_WRKMULT_ST_ST_2_Msk                 0xFF0000UL
#define UDB_WRKMULT_ST_ST_3_Pos                 24UL
#define UDB_WRKMULT_ST_ST_3_Msk                 0xFF000000UL
/* UDB_WRKMULT.CTL */
#define UDB_WRKMULT_CTL_CTL_0_Pos               0UL
#define UDB_WRKMULT_CTL_CTL_0_Msk               0xFFUL
#define UDB_WRKMULT_CTL_CTL_1_Pos               8UL
#define UDB_WRKMULT_CTL_CTL_1_Msk               0xFF00UL
#define UDB_WRKMULT_CTL_CTL_2_Pos               16UL
#define UDB_WRKMULT_CTL_CTL_2_Msk               0xFF0000UL
#define UDB_WRKMULT_CTL_CTL_3_Pos               24UL
#define UDB_WRKMULT_CTL_CTL_3_Msk               0xFF000000UL
/* UDB_WRKMULT.MSK */
#define UDB_WRKMULT_MSK_MSK_0_Pos               0UL
#define UDB_WRKMULT_MSK_MSK_0_Msk               0x7FUL
#define UDB_WRKMULT_MSK_MSK_1_Pos               8UL
#define UDB_WRKMULT_MSK_MSK_1_Msk               0x7F00UL
#define UDB_WRKMULT_MSK_MSK_2_Pos               16UL
#define UDB_WRKMULT_MSK_MSK_2_Msk               0x7F0000UL
#define UDB_WRKMULT_MSK_MSK_3_Pos               24UL
#define UDB_WRKMULT_MSK_MSK_3_Msk               0x7F000000UL
/* UDB_WRKMULT.ACTL */
#define UDB_WRKMULT_ACTL_FIFO0_CLR_0_Pos        0UL
#define UDB_WRKMULT_ACTL_FIFO0_CLR_0_Msk        0x1UL
#define UDB_WRKMULT_ACTL_FIFO1_CLR_0_Pos        1UL
#define UDB_WRKMULT_ACTL_FIFO1_CLR_0_Msk        0x2UL
#define UDB_WRKMULT_ACTL_FIFO0_LVL_0_Pos        2UL
#define UDB_WRKMULT_ACTL_FIFO0_LVL_0_Msk        0x4UL
#define UDB_WRKMULT_ACTL_FIFO1_LVL_0_Pos        3UL
#define UDB_WRKMULT_ACTL_FIFO1_LVL_0_Msk        0x8UL
#define UDB_WRKMULT_ACTL_INT_EN_0_Pos           4UL
#define UDB_WRKMULT_ACTL_INT_EN_0_Msk           0x10UL
#define UDB_WRKMULT_ACTL_CNT_START_0_Pos        5UL
#define UDB_WRKMULT_ACTL_CNT_START_0_Msk        0x20UL
#define UDB_WRKMULT_ACTL_FIFO0_CLR_1_Pos        8UL
#define UDB_WRKMULT_ACTL_FIFO0_CLR_1_Msk        0x100UL
#define UDB_WRKMULT_ACTL_FIFO1_CLR_1_Pos        9UL
#define UDB_WRKMULT_ACTL_FIFO1_CLR_1_Msk        0x200UL
#define UDB_WRKMULT_ACTL_FIFO0_LVL_1_Pos        10UL
#define UDB_WRKMULT_ACTL_FIFO0_LVL_1_Msk        0x400UL
#define UDB_WRKMULT_ACTL_FIFO1_LVL_1_Pos        11UL
#define UDB_WRKMULT_ACTL_FIFO1_LVL_1_Msk        0x800UL
#define UDB_WRKMULT_ACTL_INT_EN_1_Pos           12UL
#define UDB_WRKMULT_ACTL_INT_EN_1_Msk           0x1000UL
#define UDB_WRKMULT_ACTL_CNT_START_1_Pos        13UL
#define UDB_WRKMULT_ACTL_CNT_START_1_Msk        0x2000UL
#define UDB_WRKMULT_ACTL_FIFO0_CLR_2_Pos        16UL
#define UDB_WRKMULT_ACTL_FIFO0_CLR_2_Msk        0x10000UL
#define UDB_WRKMULT_ACTL_FIFO1_CLR_2_Pos        17UL
#define UDB_WRKMULT_ACTL_FIFO1_CLR_2_Msk        0x20000UL
#define UDB_WRKMULT_ACTL_FIFO0_LVL_2_Pos        18UL
#define UDB_WRKMULT_ACTL_FIFO0_LVL_2_Msk        0x40000UL
#define UDB_WRKMULT_ACTL_FIFO1_LVL_2_Pos        19UL
#define UDB_WRKMULT_ACTL_FIFO1_LVL_2_Msk        0x80000UL
#define UDB_WRKMULT_ACTL_INT_EN_2_Pos           20UL
#define UDB_WRKMULT_ACTL_INT_EN_2_Msk           0x100000UL
#define UDB_WRKMULT_ACTL_CNT_START_2_Pos        21UL
#define UDB_WRKMULT_ACTL_CNT_START_2_Msk        0x200000UL
#define UDB_WRKMULT_ACTL_FIFO0_CLR_3_Pos        24UL
#define UDB_WRKMULT_ACTL_FIFO0_CLR_3_Msk        0x1000000UL
#define UDB_WRKMULT_ACTL_FIFO1_CLR_3_Pos        25UL
#define UDB_WRKMULT_ACTL_FIFO1_CLR_3_Msk        0x2000000UL
#define UDB_WRKMULT_ACTL_FIFO0_LVL_3_Pos        26UL
#define UDB_WRKMULT_ACTL_FIFO0_LVL_3_Msk        0x4000000UL
#define UDB_WRKMULT_ACTL_FIFO1_LVL_3_Pos        27UL
#define UDB_WRKMULT_ACTL_FIFO1_LVL_3_Msk        0x8000000UL
#define UDB_WRKMULT_ACTL_INT_EN_3_Pos           28UL
#define UDB_WRKMULT_ACTL_INT_EN_3_Msk           0x10000000UL
#define UDB_WRKMULT_ACTL_CNT_START_3_Pos        29UL
#define UDB_WRKMULT_ACTL_CNT_START_3_Msk        0x20000000UL
/* UDB_WRKMULT.MC */
#define UDB_WRKMULT_MC_PLD0_MC_0_Pos            0UL
#define UDB_WRKMULT_MC_PLD0_MC_0_Msk            0xFUL
#define UDB_WRKMULT_MC_PLD1_MC_0_Pos            4UL
#define UDB_WRKMULT_MC_PLD1_MC_0_Msk            0xF0UL
#define UDB_WRKMULT_MC_PLD0_MC_1_Pos            8UL
#define UDB_WRKMULT_MC_PLD0_MC_1_Msk            0xF00UL
#define UDB_WRKMULT_MC_PLD1_MC_1_Pos            12UL
#define UDB_WRKMULT_MC_PLD1_MC_1_Msk            0xF000UL
#define UDB_WRKMULT_MC_PLD0_MC_2_Pos            16UL
#define UDB_WRKMULT_MC_PLD0_MC_2_Msk            0xF0000UL
#define UDB_WRKMULT_MC_PLD1_MC_2_Pos            20UL
#define UDB_WRKMULT_MC_PLD1_MC_2_Msk            0xF00000UL
#define UDB_WRKMULT_MC_PLD0_MC_3_Pos            24UL
#define UDB_WRKMULT_MC_PLD0_MC_3_Msk            0xF000000UL
#define UDB_WRKMULT_MC_PLD1_MC_3_Pos            28UL
#define UDB_WRKMULT_MC_PLD1_MC_3_Msk            0xF0000000UL


