zephyrproject-rtos/zephyr/ext/hal/cypress/PDL/3.1.0/devices/psoc6/include/ip/cyip_udb.h
#define UDB_UDBPAIR_ROUTE_LHO_CFG10_LHO85SEL_Pos 20UL
#define UDB_UDBPAIR_ROUTE_LHO_CFG10_LHO85SEL_Msk 0xF00000UL
#define UDB_UDBPAIR_ROUTE_LHO_CFG10_LHO86SEL_Pos 24UL
#define UDB_UDBPAIR_ROUTE_LHO_CFG10_LHO86SEL_Msk 0xF000000UL
#define UDB_UDBPAIR_ROUTE_LHO_CFG10_LHO87SEL_Pos 28UL
#define UDB_UDBPAIR_ROUTE_LHO_CFG10_LHO87SEL_Msk 0xF0000000UL
/* UDB_UDBPAIR_ROUTE.LHO_CFG11 */
#define UDB_UDBPAIR_ROUTE_LHO_CFG11_LHO88SEL_Pos 0UL
#define UDB_UDBPAIR_ROUTE_LHO_CFG11_LHO88SEL_Msk 0xFUL
#define UDB_UDBPAIR_ROUTE_LHO_CFG11_LHO89SEL_Pos 4UL
#define UDB_UDBPAIR_ROUTE_LHO_CFG11_LHO89SEL_Msk 0xF0UL
#define UDB_UDBPAIR_ROUTE_LHO_CFG11_LHO90SEL_Pos 8UL
#define UDB_UDBPAIR_ROUTE_LHO_CFG11_LHO90SEL_Msk 0xF00UL
#define UDB_UDBPAIR_ROUTE_LHO_CFG11_LHO91SEL_Pos 12UL
#define UDB_UDBPAIR_ROUTE_LHO_CFG11_LHO91SEL_Msk 0xF000UL
#define UDB_UDBPAIR_ROUTE_LHO_CFG11_LHO92SEL_Pos 16UL
#define UDB_UDBPAIR_ROUTE_LHO_CFG11_LHO92SEL_Msk 0xF0000UL
#define UDB_UDBPAIR_ROUTE_LHO_CFG11_LHO93SEL_Pos 20UL
#define UDB_UDBPAIR_ROUTE_LHO_CFG11_LHO93SEL_Msk 0xF00000UL
#define UDB_UDBPAIR_ROUTE_LHO_CFG11_LHO94SEL_Pos 24UL
#define UDB_UDBPAIR_ROUTE_LHO_CFG11_LHO94SEL_Msk 0xF000000UL
#define UDB_UDBPAIR_ROUTE_LHO_CFG11_LHO95SEL_Pos 28UL
#define UDB_UDBPAIR_ROUTE_LHO_CFG11_LHO95SEL_Msk 0xF0000000UL


/* UDB_DSI.LVO1_V_2 */
#define UDB_DSI_LVO1_V_2_LVO1_V_2_Pos           0UL
#define UDB_DSI_LVO1_V_2_LVO1_V_2_Msk           0xFFFFFFFFUL
/* UDB_DSI.RVO1_V_2 */
#define UDB_DSI_RVO1_V_2_RVO1_V_2_Pos           0UL
#define UDB_DSI_RVO1_V_2_RVO1_V_2_Msk           0xFFFFFFFFUL
/* UDB_DSI.DOP_CFG0 */
#define UDB_DSI_DOP_CFG0_DOP0SEL_Pos            0UL
#define UDB_DSI_DOP_CFG0_DOP0SEL_Msk            0x1FUL
#define UDB_DSI_DOP_CFG0_DOP1SEL_Pos            8UL
#define UDB_DSI_DOP_CFG0_DOP1SEL_Msk            0x1F00UL
#define UDB_DSI_DOP_CFG0_DOP2SEL_Pos            16UL
#define UDB_DSI_DOP_CFG0_DOP2SEL_Msk            0x1F0000UL
#define UDB_DSI_DOP_CFG0_DOP3SEL_Pos            24UL
#define UDB_DSI_DOP_CFG0_DOP3SEL_Msk            0x1F000000UL
/* UDB_DSI.DOP_CFG1 */
#define UDB_DSI_DOP_CFG1_DOP4SEL_Pos            0UL
#define UDB_DSI_DOP_CFG1_DOP4SEL_Msk            0x1FUL
#define UDB_DSI_DOP_CFG1_DOP5SEL_Pos            8UL
#define UDB_DSI_DOP_CFG1_DOP5SEL_Msk            0x1F00UL
#define UDB_DSI_DOP_CFG1_DOP6SEL_Pos            16UL
#define UDB_DSI_DOP_CFG1_DOP6SEL_Msk            0x1F0000UL
#define UDB_DSI_DOP_CFG1_DOP7SEL_Pos            24UL
#define UDB_DSI_DOP_CFG1_DOP7SEL_Msk            0x1F000000UL
/* UDB_DSI.DOP_CFG2 */
#define UDB_DSI_DOP_CFG2_DOP8SEL_Pos            0UL
#define UDB_DSI_DOP_CFG2_DOP8SEL_Msk            0x1FUL
#define UDB_DSI_DOP_CFG2_DOP9SEL_Pos            8UL
#define UDB_DSI_DOP_CFG2_DOP9SEL_Msk            0x1F00UL
#define UDB_DSI_DOP_CFG2_DOP10SEL_Pos           16UL
#define UDB_DSI_DOP_CFG2_DOP10SEL_Msk           0x1F0000UL
#define UDB_DSI_DOP_CFG2_DOP11SEL_Pos           24UL
#define UDB_DSI_DOP_CFG2_DOP11SEL_Msk           0x1F000000UL
/* UDB_DSI.DOP_CFG3 */
#define UDB_DSI_DOP_CFG3_DOP12SEL_Pos           0UL
#define UDB_DSI_DOP_CFG3_DOP12SEL_Msk           0x1FUL
#define UDB_DSI_DOP_CFG3_DOP13SEL_Pos           8UL
#define UDB_DSI_DOP_CFG3_DOP13SEL_Msk           0x1F00UL
#define UDB_DSI_DOP_CFG3_DOP14SEL_Pos           16UL
#define UDB_DSI_DOP_CFG3_DOP14SEL_Msk           0x1F0000UL
#define UDB_DSI_DOP_CFG3_DOP15SEL_Pos           24UL
#define UDB_DSI_DOP_CFG3_DOP15SEL_Msk           0x1F000000UL
/* UDB_DSI.DOT_CFG0 */
#define UDB_DSI_DOT_CFG0_DOT0SEL_Pos            0UL
#define UDB_DSI_DOT_CFG0_DOT0SEL_Msk            0x1FUL
#define UDB_DSI_DOT_CFG0_DOT1SEL_Pos            8UL
#define UDB_DSI_DOT_CFG0_DOT1SEL_Msk            0x1F00UL
#define UDB_DSI_DOT_CFG0_DOT2SEL_Pos            16UL
#define UDB_DSI_DOT_CFG0_DOT2SEL_Msk            0x1F0000UL
#define UDB_DSI_DOT_CFG0_DOT3SEL_Pos            24UL
#define UDB_DSI_DOT_CFG0_DOT3SEL_Msk            0x1F000000UL
/* UDB_DSI.DOT_CFG1 */
#define UDB_DSI_DOT_CFG1_DOT4SEL_Pos            0UL
#define UDB_DSI_DOT_CFG1_DOT4SEL_Msk            0x1FUL
#define UDB_DSI_DOT_CFG1_DOT5SEL_Pos            8UL
#define UDB_DSI_DOT_CFG1_DOT5SEL_Msk            0x1F00UL
#define UDB_DSI_DOT_CFG1_DOT6SEL_Pos            16UL
#define UDB_DSI_DOT_CFG1_DOT6SEL_Msk            0x1F0000UL
#define UDB_DSI_DOT_CFG1_DOT7SEL_Pos            24UL
#define UDB_DSI_DOT_CFG1_DOT7SEL_Msk            0x1F000000UL
/* UDB_DSI.DOT_CFG2 */
#define UDB_DSI_DOT_CFG2_DOT8SEL_Pos            0UL
#define UDB_DSI_DOT_CFG2_DOT8SEL_Msk            0x1FUL
#define UDB_DSI_DOT_CFG2_DOT9SEL_Pos            8UL
#define UDB_DSI_DOT_CFG2_DOT9SEL_Msk            0x1F00UL
#define UDB_DSI_DOT_CFG2_DOT10SEL_Pos           16UL
#define UDB_DSI_DOT_CFG2_DOT10SEL_Msk           0x1F0000UL
#define UDB_DSI_DOT_CFG2_DOT11SEL_Pos           24UL
#define UDB_DSI_DOT_CFG2_DOT11SEL_Msk           0x1F000000UL
/* UDB_DSI.DOT_CFG3 */
#define UDB_DSI_DOT_CFG3_DOT12SEL_Pos           0UL
#define UDB_DSI_DOT_CFG3_DOT12SEL_Msk           0x1FUL
#define UDB_DSI_DOT_CFG3_DOT13SEL_Pos           8UL
#define UDB_DSI_DOT_CFG3_DOT13SEL_Msk           0x1F00UL
#define UDB_DSI_DOT_CFG3_DOT14SEL_Pos           16UL
#define UDB_DSI_DOT_CFG3_DOT14SEL_Msk           0x1F0000UL
#define UDB_DSI_DOT_CFG3_DOT15SEL_Pos           24UL
#define UDB_DSI_DOT_CFG3_DOT15SEL_Msk           0x1F000000UL
/* UDB_DSI.RVO_CFG0 */
#define UDB_DSI_RVO_CFG0_RVO0SEL_Pos            0UL
#define UDB_DSI_RVO_CFG0_RVO0SEL_Msk            0x1FUL
#define UDB_DSI_RVO_CFG0_RVO1SEL_Pos            8UL
#define UDB_DSI_RVO_CFG0_RVO1SEL_Msk            0x1F00UL
#define UDB_DSI_RVO_CFG0_RVO2SEL_Pos            16UL
#define UDB_DSI_RVO_CFG0_RVO2SEL_Msk            0x1F0000UL
#define UDB_DSI_RVO_CFG0_RVO3SEL_Pos            24UL
#define UDB_DSI_RVO_CFG0_RVO3SEL_Msk            0x1F000000UL
/* UDB_DSI.RVO_CFG1 */
#define UDB_DSI_RVO_CFG1_RVO4SEL_Pos            0UL
#define UDB_DSI_RVO_CFG1_RVO4SEL_Msk            0x1FUL
#define UDB_DSI_RVO_CFG1_RVO5SEL_Pos            8UL
#define UDB_DSI_RVO_CFG1_RVO5SEL_Msk            0x1F00UL
#define UDB_DSI_RVO_CFG1_RVO6SEL_Pos            16UL
#define UDB_DSI_RVO_CFG1_RVO6SEL_Msk            0x1F0000UL
#define UDB_DSI_RVO_CFG1_RVO7SEL_Pos            24UL
#define UDB_DSI_RVO_CFG1_RVO7SEL_Msk            0x1F000000UL
/* UDB_DSI.RVO_CFG2 */
#define UDB_DSI_RVO_CFG2_RVO8SEL_Pos            0UL
#define UDB_DSI_RVO_CFG2_RVO8SEL_Msk            0x1FUL
#define UDB_DSI_RVO_CFG2_RVO9SEL_Pos            8UL
#define UDB_DSI_RVO_CFG2_RVO9SEL_Msk            0x1F00UL
#define UDB_DSI_RVO_CFG2_RVO10SEL_Pos           16UL
#define UDB_DSI_RVO_CFG2_RVO10SEL_Msk           0x1F0000UL
#define UDB_DSI_RVO_CFG2_RVO11SEL_Pos           24UL
#define UDB_DSI_RVO_CFG2_RVO11SEL_Msk           0x1F000000UL
/* UDB_DSI.RVO_CFG3 */
#define UDB_DSI_RVO_CFG3_RVO12SEL_Pos           0UL
#define UDB_DSI_RVO_CFG3_RVO12SEL_Msk           0x1FUL
#define UDB_DSI_RVO_CFG3_RVO13SEL_Pos           8UL
#define UDB_DSI_RVO_CFG3_RVO13SEL_Msk           0x1F00UL
#define UDB_DSI_RVO_CFG3_RVO14SEL_Pos           16UL
#define UDB_DSI_RVO_CFG3_RVO14SEL_Msk           0x1F0000UL
#define UDB_DSI_RVO_CFG3_RVO15SEL_Pos           24UL
#define UDB_DSI_RVO_CFG3_RVO15SEL_Msk           0x1F000000UL
/* UDB_DSI.LVO_CFG0 */
#define UDB_DSI_LVO_CFG0_LVO0SEL_Pos            0UL
#define UDB_DSI_LVO_CFG0_LVO0SEL_Msk            0xFUL
#define UDB_DSI_LVO_CFG0_LVO1SEL_Pos            4UL
#define UDB_DSI_LVO_CFG0_LVO1SEL_Msk            0xF0UL
#define UDB_DSI_LVO_CFG0_LVO2SEL_Pos            8UL
#define UDB_DSI_LVO_CFG0_LVO2SEL_Msk            0xF00UL
#define UDB_DSI_LVO_CFG0_LVO3SEL_Pos            12UL
#define UDB_DSI_LVO_CFG0_LVO3SEL_Msk            0xF000UL
#define UDB_DSI_LVO_CFG0_LVO4SEL_Pos            16UL
#define UDB_DSI_LVO_CFG0_LVO4SEL_Msk            0xF0000UL
#define UDB_DSI_LVO_CFG0_LVO5SEL_Pos            20UL
#define UDB_DSI_LVO_CFG0_LVO5SEL_Msk            0xF00000UL
#define UDB_DSI_LVO_CFG0_LVO6SEL_Pos            24UL
#define UDB_DSI_LVO_CFG0_LVO6SEL_Msk            0xF000000UL
#define UDB_DSI_LVO_CFG0_LVO7SEL_Pos            28UL
#define UDB_DSI_LVO_CFG0_LVO7SEL_Msk            0xF0000000UL
/* UDB_DSI.LVO_CFG1 */
#define UDB_DSI_LVO_CFG1_LVO8SEL_Pos            0UL
#define UDB_DSI_LVO_CFG1_LVO8SEL_Msk            0xFUL
#define UDB_DSI_LVO_CFG1_LVO9SEL_Pos            4UL
#define UDB_DSI_LVO_CFG1_LVO9SEL_Msk            0xF0UL
#define UDB_DSI_LVO_CFG1_LVO10SEL_Pos           8UL
#define UDB_DSI_LVO_CFG1_LVO10SEL_Msk           0xF00UL
#define UDB_DSI_LVO_CFG1_LVO11SEL_Pos           12UL
#define UDB_DSI_LVO_CFG1_LVO11SEL_Msk           0xF000UL
#define UDB_DSI_LVO_CFG1_LVO12SEL_Pos           16UL
#define UDB_DSI_LVO_CFG1_LVO12SEL_Msk           0xF0000UL
#define UDB_DSI_LVO_CFG1_LVO13SEL_Pos           20UL
#define UDB_DSI_LVO_CFG1_LVO13SEL_Msk           0xF00000UL
#define UDB_DSI_LVO_CFG1_LVO14SEL_Pos           24UL
#define UDB_DSI_LVO_CFG1_LVO14SEL_Msk           0xF000000UL
#define UDB_DSI_LVO_CFG1_LVO15SEL_Pos           28UL
#define UDB_DSI_LVO_CFG1_LVO15SEL_Msk           0xF0000000UL
/* UDB_DSI.RHO_CFG0 */
#define UDB_DSI_RHO_CFG0_RHOSEL_Pos             0UL
#define UDB_DSI_RHO_CFG0_RHOSEL_Msk             0xFFFFFFFFUL
/* UDB_DSI.RHO_CFG1 */
#define UDB_DSI_RHO_CFG1_RHOSEL_Pos             0UL
#define UDB_DSI_RHO_CFG1_RHOSEL_Msk             0xFFFFFFFFUL
/* UDB_DSI.RHO_CFG2 */
#define UDB_DSI_RHO_CFG2_RHOSEL_Pos             0UL
#define UDB_DSI_RHO_CFG2_RHOSEL_Msk             0xFFFFFFFFUL
/* UDB_DSI.LHO_CFG0 */
#define UDB_DSI_LHO_CFG0_LHO0SEL_Pos            0UL
#define UDB_DSI_LHO_CFG0_LHO0SEL_Msk            0xFUL
#define UDB_DSI_LHO_CFG0_LHO1SEL_Pos            4UL
#define UDB_DSI_LHO_CFG0_LHO1SEL_Msk            0xF0UL
#define UDB_DSI_LHO_CFG0_LHO2SEL_Pos            8UL
#define UDB_DSI_LHO_CFG0_LHO2SEL_Msk            0xF00UL
#define UDB_DSI_LHO_CFG0_LHO3SEL_Pos            12UL
#define UDB_DSI_LHO_CFG0_LHO3SEL_Msk            0xF000UL
#define UDB_DSI_LHO_CFG0_LHO4SEL_Pos            16UL
#define UDB_DSI_LHO_CFG0_LHO4SEL_Msk            0xF0000UL
#define UDB_DSI_LHO_CFG0_LHO5SEL_Pos            20UL
#define UDB_DSI_LHO_CFG0_LHO5SEL_Msk            0xF00000UL
#define UDB_DSI_LHO_CFG0_LHO6SEL_Pos            24UL
#define UDB_DSI_LHO_CFG0_LHO6SEL_Msk            0xF000000UL
#define UDB_DSI_LHO_CFG0_LHO7SEL_Pos            28UL
#define UDB_DSI_LHO_CFG0_LHO7SEL_Msk            0xF0000000UL
/* UDB_DSI.LHO_CFG1 */
#define UDB_DSI_LHO_CFG1_LHO8SEL_Pos            0UL
#define UDB_DSI_LHO_CFG1_LHO8SEL_Msk            0xFUL
#define UDB_DSI_LHO_CFG1_LHO9SEL_Pos            4UL
#define UDB_DSI_LHO_CFG1_LHO9SEL_Msk            0xF0UL
#define UDB_DSI_LHO_CFG1_LHO10SEL_Pos           8UL
#define UDB_DSI_LHO_CFG1_LHO10SEL_Msk           0xF00UL
#define UDB_DSI_LHO_CFG1_LHO11SEL_Pos           12UL
#define UDB_DSI_LHO_CFG1_LHO11SEL_Msk           0xF000UL
#define UDB_DSI_LHO_CFG1_LHO12SEL_Pos           16UL
#define UDB_DSI_LHO_CFG1_LHO12SEL_Msk           0xF0000UL
#define UDB_DSI_LHO_CFG1_LHO13SEL_Pos           20UL
#define UDB_DSI_LHO_CFG1_LHO13SEL_Msk           0xF00000UL
#define UDB_DSI_LHO_CFG1_LHO14SEL_Pos           24UL
#define UDB_DSI_LHO_CFG1_LHO14SEL_Msk           0xF000000UL
#define UDB_DSI_LHO_CFG1_LHO15SEL_Pos           28UL
#define UDB_DSI_LHO_CFG1_LHO15SEL_Msk           0xF0000000UL
/* UDB_DSI.LHO_CFG2 */
#define UDB_DSI_LHO_CFG2_LHO16SEL_Pos           0UL
#define UDB_DSI_LHO_CFG2_LHO16SEL_Msk           0xFUL
#define UDB_DSI_LHO_CFG2_LHO17SEL_Pos           4UL
#define UDB_DSI_LHO_CFG2_LHO17SEL_Msk           0xF0UL
#define UDB_DSI_LHO_CFG2_LHO18SEL_Pos           8UL
#define UDB_DSI_LHO_CFG2_LHO18SEL_Msk           0xF00UL
#define UDB_DSI_LHO_CFG2_LHO19SEL_Pos           12UL
#define UDB_DSI_LHO_CFG2_LHO19SEL_Msk           0xF000UL
#define UDB_DSI_LHO_CFG2_LHO20SEL_Pos           16UL
#define UDB_DSI_LHO_CFG2_LHO20SEL_Msk           0xF0000UL
#define UDB_DSI_LHO_CFG2_LHO21SEL_Pos           20UL
#define UDB_DSI_LHO_CFG2_LHO21SEL_Msk           0xF00000UL
#define UDB_DSI_LHO_CFG2_LHO22SEL_Pos           24UL
#define UDB_DSI_LHO_CFG2_LHO22SEL_Msk           0xF000000UL
#define UDB_DSI_LHO_CFG2_LHO23SEL_Pos           28UL
#define UDB_DSI_LHO_CFG2_LHO23SEL_Msk           0xF0000000UL
/* UDB_DSI.LHO_CFG3 */
#define UDB_DSI_LHO_CFG3_LHO24SEL_Pos           0UL
#define UDB_DSI_LHO_CFG3_LHO24SEL_Msk           0xFUL
#define UDB_DSI_LHO_CFG3_LHO25SEL_Pos           4UL
#define UDB_DSI_LHO_CFG3_LHO25SEL_Msk           0xF0UL
#define UDB_DSI_LHO_CFG3_LHO26SEL_Pos           8UL
#define UDB_DSI_LHO_CFG3_LHO26SEL_Msk           0xF00UL
#define UDB_DSI_LHO_CFG3_LHO27SEL_Pos           12UL
#define UDB_DSI_LHO_CFG3_LHO27SEL_Msk           0xF000UL
#define UDB_DSI_LHO_CFG3_LHO28SEL_Pos           16UL
#define UDB_DSI_LHO_CFG3_LHO28SEL_Msk           0xF0000UL
#define UDB_DSI_LHO_CFG3_LHO29SEL_Pos           20UL
#define UDB_DSI_LHO_CFG3_LHO29SEL_Msk           0xF00000UL
#define UDB_DSI_LHO_CFG3_LHO30SEL_Pos           24UL
#define UDB_DSI_LHO_CFG3_LHO30SEL_Msk           0xF000000UL
#define UDB_DSI_LHO_CFG3_LHO31SEL_Pos           28UL
#define UDB_DSI_LHO_CFG3_LHO31SEL_Msk           0xF0000000UL
/* UDB_DSI.LHO_CFG4 */
#define UDB_DSI_LHO_CFG4_LHO32SEL_Pos           0UL
#define UDB_DSI_LHO_CFG4_LHO32SEL_Msk           0xFUL
#define UDB_DSI_LHO_CFG4_LHO33SEL_Pos           4UL
#define UDB_DSI_LHO_CFG4_LHO33SEL_Msk           0xF0UL
#define UDB_DSI_LHO_CFG4_LHO34SEL_Pos           8UL
#define UDB_DSI_LHO_CFG4_LHO34SEL_Msk           0xF00UL
#define UDB_DSI_LHO_CFG4_LHO35SEL_Pos           12UL
#define UDB_DSI_LHO_CFG4_LHO35SEL_Msk           0xF000UL
#define UDB_DSI_LHO_CFG4_LHO36SEL_Pos           16UL
#define UDB_DSI_LHO_CFG4_LHO36SEL_Msk           0xF0000UL
#define UDB_DSI_LHO_CFG4_LHO37SEL_Pos           20UL
#define UDB_DSI_LHO_CFG4_LHO37SEL_Msk           0xF00000UL
#define UDB_DSI_LHO_CFG4_LHO38SEL_Pos           24UL
#define UDB_DSI_LHO_CFG4_LHO38SEL_Msk           0xF000000UL
#define UDB_DSI_LHO_CFG4_LHO39SEL_Pos           28UL
#define UDB_DSI_LHO_CFG4_LHO39SEL_Msk           0xF0000000UL
/* UDB_DSI.LHO_CFG5 */
#define UDB_DSI_LHO_CFG5_LHO40SEL_Pos           0UL
#define UDB_DSI_LHO_CFG5_LHO40SEL_Msk           0xFUL
#define UDB_DSI_LHO_CFG5_LHO41SEL_Pos           4UL
#define UDB_DSI_LHO_CFG5_LHO41SEL_Msk           0xF0UL
#define UDB_DSI_LHO_CFG5_LHO42SEL_Pos           8UL
#define UDB_DSI_LHO_CFG5_LHO42SEL_Msk           0xF00UL
#define UDB_DSI_LHO_CFG5_LHO43SEL_Pos           12UL
#define UDB_DSI_LHO_CFG5_LHO43SEL_Msk           0xF000UL
#define UDB_DSI_LHO_CFG5_LHO44SEL_Pos           16UL
#define UDB_DSI_LHO_CFG5_LHO44SEL_Msk           0xF0000UL
#define UDB_DSI_LHO_CFG5_LHO45SEL_Pos           20UL
#define UDB_DSI_LHO_CFG5_LHO45SEL_Msk           0xF00000UL
#define UDB_DSI_LHO_CFG5_LHO46SEL_Pos           24UL
#define UDB_DSI_LHO_CFG5_LHO46SEL_Msk           0xF000000UL
#define UDB_DSI_LHO_CFG5_LHO47SEL_Pos           28UL
#define UDB_DSI_LHO_CFG5_LHO47SEL_Msk           0xF0000000UL
/* UDB_DSI.LHO_CFG6 */
#define UDB_DSI_LHO_CFG6_LHO48SEL_Pos           0UL
#define UDB_DSI_LHO_CFG6_LHO48SEL_Msk           0xFUL
#define UDB_DSI_LHO_CFG6_LHO49SEL_Pos           4UL
#define UDB_DSI_LHO_CFG6_LHO49SEL_Msk           0xF0UL
#define UDB_DSI_LHO_CFG6_LHO50SEL_Pos           8UL
#define UDB_DSI_LHO_CFG6_LHO50SEL_Msk           0xF00UL
#define UDB_DSI_LHO_CFG6_LHO51SEL_Pos           12UL
#define UDB_DSI_LHO_CFG6_LHO51SEL_Msk           0xF000UL
#define UDB_DSI_LHO_CFG6_LHO52SEL_Pos           16UL
#define UDB_DSI_LHO_CFG6_LHO52SEL_Msk           0xF0000UL
#define UDB_DSI_LHO_CFG6_LHO53SEL_Pos           20UL
#define UDB_DSI_LHO_CFG6_LHO53SEL_Msk           0xF00000UL
#define UDB_DSI_LHO_CFG6_LHO54SEL_Pos           24UL
#define UDB_DSI_LHO_CFG6_LHO54SEL_Msk           0xF000000UL
#define UDB_DSI_LHO_CFG6_LHO55SEL_Pos           28UL
#define UDB_DSI_LHO_CFG6_LHO55SEL_Msk           0xF0000000UL
/* UDB_DSI.LHO_CFG7 */
#define UDB_DSI_LHO_CFG7_LHO56SEL_Pos           0UL
#define UDB_DSI_LHO_CFG7_LHO56SEL_Msk           0xFUL
#define UDB_DSI_LHO_CFG7_LHO57SEL_Pos           4UL
#define UDB_DSI_LHO_CFG7_LHO57SEL_Msk           0xF0UL
#define UDB_DSI_LHO_CFG7_LHO58SEL_Pos           8UL
#define UDB_DSI_LHO_CFG7_LHO58SEL_Msk           0xF00UL
#define UDB_DSI_LHO_CFG7_LHO59SEL_Pos           12UL
#define UDB_DSI_LHO_CFG7_LHO59SEL_Msk           0xF000UL
#define UDB_DSI_LHO_CFG7_LHO60SEL_Pos           16UL
#define UDB_DSI_LHO_CFG7_LHO60SEL_Msk           0xF0000UL
#define UDB_DSI_LHO_CFG7_LHO61SEL_Pos           20UL
#define UDB_DSI_LHO_CFG7_LHO61SEL_Msk           0xF00000UL
#define UDB_DSI_LHO_CFG7_LHO62SEL_Pos           24UL
#define UDB_DSI_LHO_CFG7_LHO62SEL_Msk           0xF000000UL
#define UDB_DSI_LHO_CFG7_LHO63SEL_Pos           28UL
#define UDB_DSI_LHO_CFG7_LHO63SEL_Msk           0xF0000000UL
/* UDB_DSI.LHO_CFG8 */
#define UDB_DSI_LHO_CFG8_LHO64SEL_Pos           0UL
#define UDB_DSI_LHO_CFG8_LHO64SEL_Msk           0xFUL
#define UDB_DSI_LHO_CFG8_LHO65SEL_Pos           4UL
#define UDB_DSI_LHO_CFG8_LHO65SEL_Msk           0xF0UL
#define UDB_DSI_LHO_CFG8_LHO66SEL_Pos           8UL
#define UDB_DSI_LHO_CFG8_LHO66SEL_Msk           0xF00UL
#define UDB_DSI_LHO_CFG8_LHO67SEL_Pos           12UL
#define UDB_DSI_LHO_CFG8_LHO67SEL_Msk           0xF000UL
#define UDB_DSI_LHO_CFG8_LHO68SEL_Pos           16UL
#define UDB_DSI_LHO_CFG8_LHO68SEL_Msk           0xF0000UL
#define UDB_DSI_LHO_CFG8_LHO69SEL_Pos           20UL
#define UDB_DSI_LHO_CFG8_LHO69SEL_Msk           0xF00000UL
#define UDB_DSI_LHO_CFG8_LHO70SEL_Pos           24UL
#define UDB_DSI_LHO_CFG8_LHO70SEL_Msk           0xF000000UL
#define UDB_DSI_LHO_CFG8_LHO71SEL_Pos           28UL
#define UDB_DSI_LHO_CFG8_LHO71SEL_Msk           0xF0000000UL
/* UDB_DSI.LHO_CFG9 */
#define UDB_DSI_LHO_CFG9_LHO72SEL_Pos           0UL
#define UDB_DSI_LHO_CFG9_LHO72SEL_Msk           0xFUL
#define UDB_DSI_LHO_CFG9_LHO73SEL_Pos           4UL
#define UDB_DSI_LHO_CFG9_LHO73SEL_Msk           0xF0UL
#define UDB_DSI_LHO_CFG9_LHO74SEL_Pos           8UL
#define UDB_DSI_LHO_CFG9_LHO74SEL_Msk           0xF00UL
#define UDB_DSI_LHO_CFG9_LHO75SEL_Pos           12UL
#define UDB_DSI_LHO_CFG9_LHO75SEL_Msk           0xF000UL
#define UDB_DSI_LHO_CFG9_LHO76SEL_Pos           16UL
#define UDB_DSI_LHO_CFG9_LHO76SEL_Msk           0xF0000UL
#define UDB_DSI_LHO_CFG9_LHO77SEL_Pos           20UL
#define UDB_DSI_LHO_CFG9_LHO77SEL_Msk           0xF00000UL
#define UDB_DSI_LHO_CFG9_LHO78SEL_Pos           24UL
#define UDB_DSI_LHO_CFG9_LHO78SEL_Msk           0xF000000UL
#define UDB_DSI_LHO_CFG9_LHO79SEL_Pos           28UL
#define UDB_DSI_LHO_CFG9_LHO79SEL_Msk           0xF0000000UL
/* UDB_DSI.LHO_CFG10 */
#define UDB_DSI_LHO_CFG10_LHO80SEL_Pos          0UL
#define UDB_DSI_LHO_CFG10_LHO80SEL_Msk          0xFUL
#define UDB_DSI_LHO_CFG10_LHO81SEL_Pos          4UL
#define UDB_DSI_LHO_CFG10_LHO81SEL_Msk          0xF0UL
#define UDB_DSI_LHO_CFG10_LHO82SEL_Pos          8UL
#define UDB_DSI_LHO_CFG10_LHO82SEL_Msk          0xF00UL
#define UDB_DSI_LHO_CFG10_LHO83SEL_Pos          12UL
#define UDB_DSI_LHO_CFG10_LHO83SEL_Msk          0xF000UL
#define UDB_DSI_LHO_CFG10_LHO84SEL_Pos          16UL
#define UDB_DSI_LHO_CFG10_LHO84SEL_Msk          0xF0000UL
#define UDB_DSI_LHO_CFG10_LHO85SEL_Pos          20UL
#define UDB_DSI_LHO_CFG10_LHO85SEL_Msk          0xF00000UL
#define UDB_DSI_LHO_CFG10_LHO86SEL_Pos          24UL
#define UDB_DSI_LHO_CFG10_LHO86SEL_Msk          0xF000000UL
#define UDB_DSI_LHO_CFG10_LHO87SEL_Pos          28UL
#define UDB_DSI_LHO_CFG10_LHO87SEL_Msk          0xF0000000UL
/* UDB_DSI.LHO_CFG11 */
#define UDB_DSI_LHO_CFG11_LHO88SEL_Pos          0UL
#define UDB_DSI_LHO_CFG11_LHO88SEL_Msk          0xFUL
#define UDB_DSI_LHO_CFG11_LHO89SEL_Pos          4UL
#define UDB_DSI_LHO_CFG11_LHO89SEL_Msk          0xF0UL
#define UDB_DSI_LHO_CFG11_LHO90SEL_Pos          8UL
#define UDB_DSI_LHO_CFG11_LHO90SEL_Msk          0xF00UL
#define UDB_DSI_LHO_CFG11_LHO91SEL_Pos          12UL
#define UDB_DSI_LHO_CFG11_LHO91SEL_Msk          0xF000UL
#define UDB_DSI_LHO_CFG11_LHO92SEL_Pos          16UL
#define UDB_DSI_LHO_CFG11_LHO92SEL_Msk          0xF0000UL
#define UDB_DSI_LHO_CFG11_LHO93SEL_Pos          20UL
#define UDB_DSI_LHO_CFG11_LHO93SEL_Msk          0xF00000UL
#define UDB_DSI_LHO_CFG11_LHO94SEL_Pos          24UL
#define UDB_DSI_LHO_CFG11_LHO94SEL_Msk          0xF000000UL
#define UDB_DSI_LHO_CFG11_LHO95SEL_Pos          28UL
#define UDB_DSI_LHO_CFG11_LHO95SEL_Msk          0xF0000000UL


