zephyrproject-rtos/zephyr/ext/hal/cypress/PDL/3.1.0/devices/psoc6/include/ip/cyip_udb.h
/* UDB_PA.CFG0 */
#define UDB_PA_CFG0_CLKIN_EN_SEL_Pos            0UL
#define UDB_PA_CFG0_CLKIN_EN_SEL_Msk            0x3UL
#define UDB_PA_CFG0_CLKIN_EN_MODE_Pos           2UL
#define UDB_PA_CFG0_CLKIN_EN_MODE_Msk           0xCUL
#define UDB_PA_CFG0_CLKIN_EN_INV_Pos            4UL
#define UDB_PA_CFG0_CLKIN_EN_INV_Msk            0x10UL
#define UDB_PA_CFG0_CLKIN_INV_Pos               5UL
#define UDB_PA_CFG0_CLKIN_INV_Msk               0x20UL
/* UDB_PA.CFG1 */
#define UDB_PA_CFG1_CLKOUT_EN_SEL_Pos           0UL
#define UDB_PA_CFG1_CLKOUT_EN_SEL_Msk           0x3UL
#define UDB_PA_CFG1_CLKOUT_EN_MODE_Pos          2UL
#define UDB_PA_CFG1_CLKOUT_EN_MODE_Msk          0xCUL
#define UDB_PA_CFG1_CLKOUT_EN_INV_Pos           4UL
#define UDB_PA_CFG1_CLKOUT_EN_INV_Msk           0x10UL
#define UDB_PA_CFG1_CLKOUT_INV_Pos              5UL
#define UDB_PA_CFG1_CLKOUT_INV_Msk              0x20UL
/* UDB_PA.CFG2 */
#define UDB_PA_CFG2_CLKIN_SEL_Pos               0UL
#define UDB_PA_CFG2_CLKIN_SEL_Msk               0xFUL
#define UDB_PA_CFG2_CLKOUT_SEL_Pos              4UL
#define UDB_PA_CFG2_CLKOUT_SEL_Msk              0xF0UL
/* UDB_PA.CFG3 */
#define UDB_PA_CFG3_RES_IN_SEL_Pos              0UL
#define UDB_PA_CFG3_RES_IN_SEL_Msk              0x3UL
#define UDB_PA_CFG3_RES_IN_INV_Pos              2UL
#define UDB_PA_CFG3_RES_IN_INV_Msk              0x4UL
#define UDB_PA_CFG3_RES_OUT_SEL_Pos             4UL
#define UDB_PA_CFG3_RES_OUT_SEL_Msk             0x30UL
#define UDB_PA_CFG3_RES_OUT_INV_Pos             6UL
#define UDB_PA_CFG3_RES_OUT_INV_Msk             0x40UL
/* UDB_PA.CFG4 */
#define UDB_PA_CFG4_RES_IN_EN_Pos               0UL
#define UDB_PA_CFG4_RES_IN_EN_Msk               0x1UL
#define UDB_PA_CFG4_RES_OUT_EN_Pos              1UL
#define UDB_PA_CFG4_RES_OUT_EN_Msk              0x2UL
#define UDB_PA_CFG4_RES_OE_EN_Pos               2UL
#define UDB_PA_CFG4_RES_OE_EN_Msk               0x4UL
/* UDB_PA.CFG5 */
#define UDB_PA_CFG5_PIN_SEL_Pos                 0UL
#define UDB_PA_CFG5_PIN_SEL_Msk                 0x7UL
/* UDB_PA.CFG6 */
#define UDB_PA_CFG6_IN_SYNC0_Pos                0UL
#define UDB_PA_CFG6_IN_SYNC0_Msk                0x3UL
#define UDB_PA_CFG6_IN_SYNC1_Pos                2UL
#define UDB_PA_CFG6_IN_SYNC1_Msk                0xCUL
#define UDB_PA_CFG6_IN_SYNC2_Pos                4UL
#define UDB_PA_CFG6_IN_SYNC2_Msk                0x30UL
#define UDB_PA_CFG6_IN_SYNC3_Pos                6UL
#define UDB_PA_CFG6_IN_SYNC3_Msk                0xC0UL
/* UDB_PA.CFG7 */
#define UDB_PA_CFG7_IN_SYNC4_Pos                0UL
#define UDB_PA_CFG7_IN_SYNC4_Msk                0x3UL
#define UDB_PA_CFG7_IN_SYNC5_Pos                2UL
#define UDB_PA_CFG7_IN_SYNC5_Msk                0xCUL
#define UDB_PA_CFG7_IN_SYNC6_Pos                4UL
#define UDB_PA_CFG7_IN_SYNC6_Msk                0x30UL
#define UDB_PA_CFG7_IN_SYNC7_Pos                6UL
#define UDB_PA_CFG7_IN_SYNC7_Msk                0xC0UL
/* UDB_PA.CFG8 */
#define UDB_PA_CFG8_OUT_SYNC0_Pos               0UL
#define UDB_PA_CFG8_OUT_SYNC0_Msk               0x3UL
#define UDB_PA_CFG8_OUT_SYNC1_Pos               2UL
#define UDB_PA_CFG8_OUT_SYNC1_Msk               0xCUL
#define UDB_PA_CFG8_OUT_SYNC2_Pos               4UL
#define UDB_PA_CFG8_OUT_SYNC2_Msk               0x30UL
#define UDB_PA_CFG8_OUT_SYNC3_Pos               6UL
#define UDB_PA_CFG8_OUT_SYNC3_Msk               0xC0UL
/* UDB_PA.CFG9 */
#define UDB_PA_CFG9_OUT_SYNC4_Pos               0UL
#define UDB_PA_CFG9_OUT_SYNC4_Msk               0x3UL
#define UDB_PA_CFG9_OUT_SYNC5_Pos               2UL
#define UDB_PA_CFG9_OUT_SYNC5_Msk               0xCUL
#define UDB_PA_CFG9_OUT_SYNC6_Pos               4UL
#define UDB_PA_CFG9_OUT_SYNC6_Msk               0x30UL
#define UDB_PA_CFG9_OUT_SYNC7_Pos               6UL
#define UDB_PA_CFG9_OUT_SYNC7_Msk               0xC0UL
/* UDB_PA.CFG10 */
#define UDB_PA_CFG10_DATA_SEL0_Pos              0UL
#define UDB_PA_CFG10_DATA_SEL0_Msk              0x3UL
#define UDB_PA_CFG10_DATA_SEL1_Pos              2UL
#define UDB_PA_CFG10_DATA_SEL1_Msk              0xCUL
#define UDB_PA_CFG10_DATA_SEL2_Pos              4UL
#define UDB_PA_CFG10_DATA_SEL2_Msk              0x30UL
#define UDB_PA_CFG10_DATA_SEL3_Pos              6UL
#define UDB_PA_CFG10_DATA_SEL3_Msk              0xC0UL
/* UDB_PA.CFG11 */
#define UDB_PA_CFG11_DATA_SEL4_Pos              0UL
#define UDB_PA_CFG11_DATA_SEL4_Msk              0x3UL
#define UDB_PA_CFG11_DATA_SEL5_Pos              2UL
#define UDB_PA_CFG11_DATA_SEL5_Msk              0xCUL
#define UDB_PA_CFG11_DATA_SEL6_Pos              4UL
#define UDB_PA_CFG11_DATA_SEL6_Msk              0x30UL
#define UDB_PA_CFG11_DATA_SEL7_Pos              6UL
#define UDB_PA_CFG11_DATA_SEL7_Msk              0xC0UL
/* UDB_PA.CFG12 */
#define UDB_PA_CFG12_OE_SEL0_Pos                0UL
#define UDB_PA_CFG12_OE_SEL0_Msk                0x3UL
#define UDB_PA_CFG12_OE_SEL1_Pos                2UL
#define UDB_PA_CFG12_OE_SEL1_Msk                0xCUL
#define UDB_PA_CFG12_OE_SEL2_Pos                4UL
#define UDB_PA_CFG12_OE_SEL2_Msk                0x30UL
#define UDB_PA_CFG12_OE_SEL3_Pos                6UL
#define UDB_PA_CFG12_OE_SEL3_Msk                0xC0UL
/* UDB_PA.CFG13 */
#define UDB_PA_CFG13_OE_SEL4_Pos                0UL
#define UDB_PA_CFG13_OE_SEL4_Msk                0x3UL
#define UDB_PA_CFG13_OE_SEL5_Pos                2UL
#define UDB_PA_CFG13_OE_SEL5_Msk                0xCUL
#define UDB_PA_CFG13_OE_SEL6_Pos                4UL
#define UDB_PA_CFG13_OE_SEL6_Msk                0x30UL
#define UDB_PA_CFG13_OE_SEL7_Pos                6UL
#define UDB_PA_CFG13_OE_SEL7_Msk                0xC0UL
/* UDB_PA.CFG14 */
#define UDB_PA_CFG14_OE_SYNC0_Pos               0UL
#define UDB_PA_CFG14_OE_SYNC0_Msk               0x3UL
#define UDB_PA_CFG14_OE_SYNC1_Pos               2UL
#define UDB_PA_CFG14_OE_SYNC1_Msk               0xCUL
#define UDB_PA_CFG14_OE_SYNC2_Pos               4UL
#define UDB_PA_CFG14_OE_SYNC2_Msk               0x30UL
#define UDB_PA_CFG14_OE_SYNC3_Pos               6UL
#define UDB_PA_CFG14_OE_SYNC3_Msk               0xC0UL


/* UDB_BCTL.MDCLK_EN */
#define UDB_BCTL_MDCLK_EN_DCEN_Pos              0UL
#define UDB_BCTL_MDCLK_EN_DCEN_Msk              0xFFUL
/* UDB_BCTL.MBCLK_EN */
#define UDB_BCTL_MBCLK_EN_BCEN_Pos              0UL
#define UDB_BCTL_MBCLK_EN_BCEN_Msk              0x1UL
/* UDB_BCTL.BOTSEL_L */
#define UDB_BCTL_BOTSEL_L_CLK_SEL0_Pos          0UL
#define UDB_BCTL_BOTSEL_L_CLK_SEL0_Msk          0x3UL
#define UDB_BCTL_BOTSEL_L_CLK_SEL1_Pos          2UL
#define UDB_BCTL_BOTSEL_L_CLK_SEL1_Msk          0xCUL
#define UDB_BCTL_BOTSEL_L_CLK_SEL2_Pos          4UL
#define UDB_BCTL_BOTSEL_L_CLK_SEL2_Msk          0x30UL
#define UDB_BCTL_BOTSEL_L_CLK_SEL3_Pos          6UL
#define UDB_BCTL_BOTSEL_L_CLK_SEL3_Msk          0xC0UL
/* UDB_BCTL.BOTSEL_U */
#define UDB_BCTL_BOTSEL_U_CLK_SEL4_Pos          0UL
#define UDB_BCTL_BOTSEL_U_CLK_SEL4_Msk          0x3UL
#define UDB_BCTL_BOTSEL_U_CLK_SEL5_Pos          2UL
#define UDB_BCTL_BOTSEL_U_CLK_SEL5_Msk          0xCUL
#define UDB_BCTL_BOTSEL_U_CLK_SEL6_Pos          4UL
#define UDB_BCTL_BOTSEL_U_CLK_SEL6_Msk          0x30UL
#define UDB_BCTL_BOTSEL_U_CLK_SEL7_Pos          6UL
#define UDB_BCTL_BOTSEL_U_CLK_SEL7_Msk          0xC0UL
/* UDB_BCTL.QCLK_EN */
#define UDB_BCTL_QCLK_EN_DCEN_Q_Pos             0UL
#define UDB_BCTL_QCLK_EN_DCEN_Q_Msk             0xFFUL
#define UDB_BCTL_QCLK_EN_BCEN_Q_Pos             8UL
#define UDB_BCTL_QCLK_EN_BCEN_Q_Msk             0x100UL
#define UDB_BCTL_QCLK_EN_DISABLE_ROUTE_Pos      11UL
#define UDB_BCTL_QCLK_EN_DISABLE_ROUTE_Msk      0x800UL


/* UDB_UDBIF.BANK_CTL */
#define UDB_UDBIF_BANK_CTL_DIS_COR_Pos          0UL
#define UDB_UDBIF_BANK_CTL_DIS_COR_Msk          0x1UL
#define UDB_UDBIF_BANK_CTL_ROUTE_EN_Pos         1UL
#define UDB_UDBIF_BANK_CTL_ROUTE_EN_Msk         0x2UL
#define UDB_UDBIF_BANK_CTL_BANK_EN_Pos          2UL
#define UDB_UDBIF_BANK_CTL_BANK_EN_Msk          0x4UL
#define UDB_UDBIF_BANK_CTL_READ_WAIT_Pos        8UL
#define UDB_UDBIF_BANK_CTL_READ_WAIT_Msk        0x100UL
/* UDB_UDBIF.INT_CLK_CTL */
#define UDB_UDBIF_INT_CLK_CTL_INT_CLK_ENABLE_Pos 0UL
#define UDB_UDBIF_INT_CLK_CTL_INT_CLK_ENABLE_Msk 0x1UL
/* UDB_UDBIF.INT_CFG */
#define UDB_UDBIF_INT_CFG_INT_MODE_CFG_Pos      0UL
#define UDB_UDBIF_INT_CFG_INT_MODE_CFG_Msk      0xFFFFFFFFUL
/* UDB_UDBIF.TR_CLK_CTL */
#define UDB_UDBIF_TR_CLK_CTL_TR_CLOCK_ENABLE_Pos 0UL
#define UDB_UDBIF_TR_CLK_CTL_TR_CLOCK_ENABLE_Msk 0x1UL
/* UDB_UDBIF.TR_CFG */
#define UDB_UDBIF_TR_CFG_TR_MODE_CFG_Pos        0UL
#define UDB_UDBIF_TR_CFG_TR_MODE_CFG_Msk        0xFFFFFFFFUL
/* UDB_UDBIF.PRIVATE */
#define UDB_UDBIF_PRIVATE_PIPELINE_MD_Pos       0UL
#define UDB_UDBIF_PRIVATE_PIPELINE_MD_Msk       0x1UL


#endif /* _CYIP_UDB_H_ */


/* [] END OF FILE */
